// Задание 2:
// Напишите функцию преобразования массива "sourceData" в массив "mappedData" (вложение file2.ts)
const sourceData = [
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Красный',
      Количество: 9.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Зеленый',
      Количество: 3.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Синий',
      Количество: 5.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Желтый',
      Количество: 6.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Коричневый',
      Количество: 7.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Розовый',
      Количество: 11.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Фиолетовый',
      Количество: 8.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Голубой',
      Количество: 2.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Белый',
      Количество: 5.0,
      Год: '2018'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Красный',
      Количество: 9.0,
      Год: '2019'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Зеленый',
      Количество: 3.0,
      Год: '2019'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Синий',
      Количество: 5.0,
      Год: '2019'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Желтый',
      Количество: 6.0,
      Год: '2019'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Коричневый',
      Количество: 7.0,
      Год: '2019'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Розовый',
      Количество: 11.0,
      Год: '2019'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Фиолетовый',
      Количество: 8.0,
      Год: '2019'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Голубой',
      Количество: 2.0,
      Год: '2019'
    }
  },
  {
    version: 'v1',
    timestamp: '2017-12-31T21:00:00.000Z',
    event: {
      Комплекс: 'Белый',
      Количество: 5.0,
      Год: '2019'
    }
  }
];

const mappedData = [
  {'2018': 9, '2019': 9, category: 'Красный'},
  {'2018': 3, '2019': 3, category: 'Зеленый'},
  {'2018': 5, '2019': 5, category: 'Синий'},
  {'2018': 6, '2019': 6, category: 'Желтый'},
  {'2018': 7, '2019': 7, category: 'Коричневый'},
  {'2018': 11, '2019': 11, category: 'Розовый'},
  {'2018': 8, '2019': 8, category: 'Фиолетовый'},
  {'2018': 2, '2019': 2, category: 'Голубой'},
  {'2018': 5, '2019': 5, category: 'Белый'}
];

sourceData.map(i => i.event)
  .map(i => ({[i.Год]: i.Количество, ['category']: i.Комплекс}))
  .reduce((result, item) => {
  const i = result.findIndex(resultItem => resultItem.category === item.category);
  if (i === -1) {
    result.push(item);
  } else {
    result[i] = {...result[i], ...item};
  }
  return result;
}, []);



